Repository: AMS-TomC/Titan
Catalog: webapp/titanembeds/translations/*/LC_MESSAGES/messages.po
Languages: ca

source: Let's get to know each other! My name is Titan, what's yours?
ca: Anem a conèixer'ns uns als altres! El meu nom és Titan, quin és la teu?

source: Hello and welcome!
ca: Hola i benvolguts!

source: What brings you here today?
ca: Què et porta aquí avui?

source: ....what do you expect this text to say?
ca: ... què espera que aquest text vol dir?

source: Aha! ..made you look!
ca: Aha!... mira què has fet!

source: Initiating launch sequence...
ca: Iniciant seqüencia de llançament...

source: Captain, what's your option?
ca: Capità, quina es la seva opció?

source: Alright, here's the usual~
ca: Bé, aquí es l'habitual ~

source: Actions
ca: Accions

source: Manage Guild Embed
ca: Gestionar el Gremi

source: Open Server on Discordapp
ca: Obrir Servidor a Discordapp

source: Channel Topic
ca: Tema del Canal

source: Channels
ca: Canals

source: Online Server Members
ca: Membres en línia del servidor

source: Authenticated Embed Users
ca: Comentaris dels usuaris autenticats

source: Guest Embed Users
ca: Comentaris dels usuaris anónims

source: Please choose one of the following methods to authenticate!
ca: Si us plau trii un del seguents metots per a iniciar sessió!

source: Discord Login
ca: Iniciar sessió amb Discord

source: You will be invited into this server.
ca: Serás convidat a aquest servidor.

source: Of course, you also have the option to login by picking a temporary username for your current browsing session.
ca: Per descomptat, tindrás la opció de iniciar sesió triant un nom temporal per aquesta seisó de navegador.

source: Username (Hit ENTER/RETURN key to confirm)
ca: Nom d'usuari(pitgi entrar/retornar per a confirmar)

source: Change Username
ca: Canviar nom d'usuari

source: Guests Accounts Only
ca: Comptes de convidats només

source: Change your username (Hit ENTER/RETURN key to confirm)
ca: Canvii el seu nom d'usuari(pitgi entrar/retornar per a confirmar)

source: Theme
ca: Tema

source: Overwrite Current Embed Theme w/ User CSS
ca: Sobreescriure l'actual tema / usuari CSS

source: Notification Sound
ca: So de notificació

source: New Messages
ca: Missatges nous

source: Mentions
ca: Mencions

source: Nothing
ca: Res

source: Just one more step...
ca: Sol una passa més...

source: Mention
ca: Menció

source: TitanEmbeds Administrator
ca: Administrador de TitanEmbeds

source: TitanEmbeds Partner
ca: Soci de TitanEmbeds

source: TitanEmbeds Supporter
ca: Soci de TitanEmbeds

source: GitHub Stargazer
ca: Stargazer de GitHub

source: User is offline in Discord.
ca: L'usuari esta desconectat a discord.

source: Playing
ca: Jugant

source: Roles
ca: Rols

source: Server Emoji
ca: Emoticones del Servidor

source: Please login to post a message.
ca: Si us plau inicieu sesií per a posar un missatge.

source: Login
ca: Iniciar Sessió
